class AzbukaMorze():
    """Класс для перевода кода морзе в текст и наоборот."""

    def __init__(self):
        """Инициализаця атрибутов"""

    def dict_morze(self):
        """Словарь с азбукой."""
        rus = {
            'а': '•-', 'б': '-•••', 'в': '•--', 'г': '--•', 'д': '-••',
            'е': '•', 'ж': '•••-', 'з': '--••', 'и': '••', 'й': '•---',
            'к': '-•-', 'л': '•-••', 'м': '--', 'н': '-•', 'о': '---',
            'п': '•--•', 'р': '•-•', 'с': '•••', 'т': '-', 'у': '••-',
            'ф': '••-•', 'х': '••••', 'ц': '-•-•', 'ч': '---•',
            'ш': '----', 'щ': '--•-', 'ъ': '--•--', 'ы': '-•--',
            'ь': '-••-', 'э': '••-••', 'ю': '••--', 'я': '•-•-',
            '0': '-----', '1': '•----', '2': '••---', '3': '•••--',
            '4': '••••-', '5': '•••••', '6': '-••••', '7': '--•••',
            '8': '---••', '9': '----•',
            '.': '••••••', ',': '•-•-•-',
            ':': '---•••', ';': '-•-•-',
            '(': '-•--•-', ')': '-•--•-',
            "'": '•----•', '"': '•-••-•',
            '—': '-••••-', '/': '-••-•',
            '?': '••--••', '!': '--••--',
            '@': '•--•-•', ' ': ' ',
        }
        return rus

    def show_menu(self):
        """Показывает меню"""
        print(
            """
            Меню:
            0 - Выход.
            1 - Перевести слово или предложение на азбуку
            2 - Перевести азбуку в символ или слово/предложение.
            """
              )

    def show_choice(self):
        """Меню"""
        choice = None
        while choice != "0":
            self.show_menu()
            choice = input("\nВаш выбор - ")
            if choice == "0":
                print("До свидания!")
            elif choice == "1":
                self.translate_words_in_morze()
            elif choice == "2":
                self.translate_morze_in_words()

    def translate_words_in_morze(self):
        """Переводит слова в азубку морзе."""
        code = ''
        words = input("Введите слово или предложение: ")
        for l in words.lower():
            if l in self.dict_morze():
                code += self.dict_morze()[l].replace(' ', '') + " "
        print(code)

    def translate_morze_in_words(self):
        """Перевожу код азбуки в обратно в текст."""
        word = ""
        code = input("Код для расшифровки: ").split()
        for c in code:
            for k, v in self.dict_morze().items():
                if v == c:
                    word += k + ' '
        print(f"Расшифровываю, это - {word}")

my = AzbukaMorze()
my.show_choice()
